# -*- coding:utf-8 -*-
# 作者：dxmy2
# 创建：2017-10-29
# 更新：2020-07-29
'''
功能：
假设每月存100元到一个年利率为6%的储蓄账户。因此，月利率为0.06/12=0.005。
第一个月后，账户的存款金额为: 100*(1+0.005)=100.5
第二个月后，账户的存款金额为: (100+100.5)*(1+0.005)=201.5025
第三个月后，账户的存款金额为: (100+201.5025)(1+0.005)=303.3115
请编写程序计算5个月后，该储蓄账户的存款金额是多少，要求保留5位小数，
右对齐显示。计算总体收益相对总体本金的收益率(此收益率值：总收益/总本金)，
以百分数形式显示，保留2位小数，右对齐。
'''
# ===== 参数说明 =====
# x[1,2,3,4,5]:每个月后的存款金额
# rate:收益率

# ===== mian =====
if __name__ == "__main__":
    
    # x[i] = (100 + x[i-1] )*(1+0.005)
    x1 = 100*(1+0.005)
    x2 = (100+x1)*(1+0.005)
    x3 = (100+x2)*(1+0.005)
    x4 = (100+x3)*(1+0.005)
    x5 = (100+x4)*(1+0.005)

    rate = (x5 - 500)/500
    
    print("After 5 months, the deposit amount of the savings account is %.5f" %x5)
    print("Rate of return is %.2f%%" % (rate*100))
